const bankCodes: { [key: string]: string } = {
  '010': 'بانک مرکزی',
  '011': 'بانک صنعت و معدن',
  '012': 'بانک ملت',
  '013': 'بانک رفاه کارگران',
  '014': 'بانک مسکن',
  '015': 'بانک سپه',
  '016': 'بانک کشاورزی',
  '017': 'بانک ملی ایران',
  '018': 'بانک تجارت',
  '019': 'بانک صادرات ایران',
  '020': 'بانک توسعه صادرات ایران',
  '021': 'پست بانک ایران',
  '022': 'بانک توسعه تعاون',
  '051': 'موسسه اعتباری توسعه',
  '053': 'بانک کارآفرین',
  '054': 'بانک پارسیان',
  '055': 'بانک اقتصاد نوین',
  '056': 'بانک سامان',
  '057': 'بانک پاسارگاد',
  '058': 'بانک سرمایه',
  '060': 'بانک سینا',
  '062': 'بانک آینده',
  '063': 'بانک شهر',
  '064': 'بانک دی',
  '066': 'بانک گردشگری',
  '069': 'بانک ایران زمین',
  '070': 'بانک رسالت',
  '073': 'موسسه اعتباری کوثر',
  '075': 'موسسه اعتباری ملل',
  '078': 'بانک خاورمیانه',
  '080': 'موسسه اعتباری نور',
  '090': 'بانک مهر ایران',
  '095': 'بانک ایران ونزوئلا',
};

/**
 * Extracts the bank name from an Iranian IBAN.
 * @param iban The full IBAN string (e.g., IR123456...).
 * @returns The name of the bank or "بانک ناشناخته" if not found.
 */
export const getBankNameFromIBAN = (iban: string): string => {
  if (typeof iban !== 'string' || iban.length < 7 || !iban.toUpperCase().startsWith('IR')) {
    return 'شماره شبا نامعتبر';
  }
  const code = iban.substring(4, 7);
  return bankCodes[code] || 'بانک ناشناخته';
};
